{
    "script": [
        {
            "scene_number": 1,
            "timestamp_start": "0:00",
            "timestamp_end": "0:05",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Wide shot of Mia Chen, 28, in hoodie and ponytail, typing furiously on her laptop amid buzzing desks and city views. Screen shows error pop-ups and buggy code. Camera zooms in on her frustrated expression as coffee spills nearby.",
            "text_on_screen": "",
            "audio_cue": "Tense, pulsing electronic music builds urgency with keyboard clacks and error beeps."
        },
        {
            "scene_number": 2,
            "timestamp_start": "0:05",
            "timestamp_end": "0:10",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Close-up on laptop screen: unreliable AI outputs flash—red warnings of potential harms like data leaks. Mia rubs her temples, scrolls through generic AI interfaces. Cut to over-shoulder shot as she deletes code in exasperation.",
            "text_on_screen": "",
            "audio_cue": "Rising tension in music, with discordant synth tones and frustrated sigh SFX."
        },
        {
            "scene_number": 3,
            "timestamp_start": "0:10",
            "timestamp_end": "0:15",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Medium shot: Dr. Elias Grant, 52, in button-down with Anthropic pin, approaches Mia with tablet. He points to screen showing Claude API integration. Quick cuts: Mia's eyes widen in curiosity; they gesture excitedly over holographic code previews.",
            "text_on_screen": "Discover Safe AI with Claude",
            "audio_cue": "Music shifts to hopeful melody, subtle whoosh for interface transitions."
        },
        {
            "scene_number": 4,
            "timestamp_start": "0:15",
            "timestamp_end": "0:20",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Dynamic montage: Fingers typing rapidly; clean, green-checkmarked code appears on screen with explanatory annotations. Camera circles as Mia smiles, testing app simulation—virtual users interact safely without errors.",
            "text_on_screen": "Interpretable. Steerable. Harmless.",
            "audio_cue": "Uplifting strings swell, with positive confirmation chimes."
        },
        {
            "scene_number": 5,
            "timestamp_start": "0:20",
            "timestamp_end": "0:25",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Triumphant wide shot: Mia high-fives Elias; app launches successfully on her phone, showing ethical safeguards. Team cheers faintly in background. Pan to window overlooking San Francisco bay, symbolizing clarity.",
            "text_on_screen": "Anthropic: Pioneering AI Safety",
            "audio_cue": "Music peaks with inspiring crescendo, applause SFX fades in."
        },
        {
            "scene_number": 6,
            "timestamp_start": "0:25",
            "timestamp_end": "0:30",
            "setting": "INT. CROWDED CO-WORKING SPACE - DAY",
            "visual_description": "Fade to logo reveal: Anthropic symbol emerges from flowing code lines. Slow zoom out to include links: anthropic.com, Claude API. End with serene bay view.",
            "text_on_screen": "Build Responsibly with Claude API\nanthropic.com",
            "audio_cue": "Music resolves to calm, empowering fade-out."
        }
    ]
}